HexSense-MIT/firmware/STM32F722/ADS131M04/ADS131M04/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f7xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define ADS_CS_Pin GPIO_PIN_0
#define ADS_CS_GPIO_Port GPIOC
#define LORA_RESET_Pin GPIO_PIN_3
#define LORA_RESET_GPIO_Port GPIOC
#define LORA_CS_Pin GPIO_PIN_0
#define LORA_CS_GPIO_Port GPIOA
#define UWB_IRQ_Pin GPIO_PIN_2
#define UWB_IRQ_GPIO_Port GPIOA
#define UWB_IRQ_EXTI_IRQn EXTI2_IRQn
#define UWB_RST_Pin GPIO_PIN_3
#define UWB_RST_GPIO_Port GPIOA
#define LORA_IRQ_Pin GPIO_PIN_4
#define LORA_IRQ_GPIO_Port GPIOA
#define LORA_IRQ_EXTI_IRQn EXTI4_IRQn
#define PIN_LED2_Pin GPIO_PIN_4
#define PIN_LED2_GPIO_Port GPIOC
#define PIN_LED1_Pin GPIO_PIN_0
#define PIN_LED1_GPIO_Port GPIOB
#define SD_CS_Pin GPIO_PIN_6
#define SD_CS_GPIO_Port GPIOC
#define UWB_CS_Pin GPIO_PIN_9
#define UWB_CS_GPIO_Port GPIOA
#define ADS_CLK_Pin GPIO_PIN_5
#define ADS_CLK_GPIO_Port GPIOB
#define ADS_SYNC_RST_Pin GPIO_PIN_8
#define ADS_SYNC_RST_GPIO_Port GPIOB
#define ADS_DRDY_Pin GPIO_PIN_9
#define ADS_DRDY_GPIO_Port GPIOB
#define ADS_DRDY_EXTI_IRQn EXTI9_5_IRQn

/* USER CODE BEGIN Private defines */
#define ADS131M04_SPI_HANDLE hspi3
/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
